# Acquire

In [6]:
import pandas as pd
from pydataset import data

1. In a jupyter notebook, `classification_exercises.ipynb`, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, `df_iris`, from this data.
    - print the first 3 rows
    - print the number of rows and columns (shape)
    - print the column names
    - print the data type of each column
    - print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [7]:
# get iris data
df_iris = data('iris')

In [8]:
#print the first 3 rows
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [9]:
#print the number of rows and columns (shape)
df_iris.shape

(150, 5)

In [10]:
#print the column names
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [11]:
#print the data type of each column
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [12]:
#print the summary statistics for each of the numeric variables. 
df_iris.describe()
#Would you recommend rescaling the data based on these statistics?
#all measurements are in cm, if range was larger then scaling may be appropriate

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

2. Read the `Table1_CustDetails` table from the `Excel_Exercises.xlsx` file into a dataframe named `df_excel`.
    - assign the first 100 rows to a new dataframe, df_excel_sample
    - print the number of rows of your original dataframe
    - print the first 5 column names
    - print the column names that have a data type of object
    - compute the range for each of the numeric variables.

In [13]:
df_excel = pd.read_excel('Excel_Exercises.xlsx')
df_excel['tenure'] = round(df_excel.total_charges/df_excel.monthly_charges)

In [14]:
#assign the first 100 rows to a new dataframe, df_excel_sample
df_excel_sample = df_excel[:100]

In [15]:
#print the number of rows of your original dataframe
df_excel.shape[0]

7049

In [16]:
#print the first 5 column names
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [17]:
#print the column names that have a data type of object
df_excel.select_dtypes(include='object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [18]:
#compute the range for each of the numeric variables.
df_range = df_excel[['monthly_charges', 'total_charges', 'tenure']].describe().transpose()
df_range = df_range['max'] - df_range['min']
df_range

monthly_charges     100.5
total_charges      8666.0
tenure               78.0
dtype: float64

3. Read the data from `this google sheet` into a dataframe, `df_google`
    - print the first 3 rows
    - print the number of rows and columns
    - print the column names
    - print the data type of each column
    - print the summary statistics for each of the numeric variables
    - print the unique values for each of your categorical variables

In [19]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

In [20]:
#print the first 3 rows
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [21]:
#print the number of rows and columns
df_google.shape

(891, 12)

In [22]:
#print the column names
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [23]:
#print the data type of each column
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [24]:
#print the summary statistics for each of the numeric variables
df_google[['Age','Fare','SibSp','Parch']].describe().T

       count       mean        std   min      25%      50%   75%       max
Age    714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
Fare   891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292
SibSp  891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
Parch  891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000

In [25]:
#print the unique values for each of your categorical variables

In [26]:
df_google.select_dtypes(include=['object', 'int']).nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
SibSp            7
Parch            7
Ticket         681
Cabin          147
Embarked         3
dtype: int64

In [27]:
df_google.Survived.value_counts(dropna=False)

0    549
1    342
Name: Survived, dtype: int64

In [28]:
df_google.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [29]:
df_google.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [30]:
df_google.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

Make a new python module, `acquire.py` to hold the following data aquisition functions:

1. Make a function named `get_titanic_data` that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [31]:
#done

2. Make a function named `get_iris_data` that returns the data from the `iris_db` on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the `species_id`s. Obtain your data from the Codeup Data Science Database.

In [32]:
#done

3. Once you've got your `get_titanic_data` and `get_iris_data` functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for a local filename like `titanic.csv` or `iris.csv`. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

In [33]:
#done

# Prepare

1. Iris Data

    a. Use the function defined in `acquire.py` to load the iris data.
    
    b. Drop the `species_id` and `measurement_id` columns.
    
    c. Rename the `species_name` column to just `species`.
    
    d. Create dummy variables of the species name.
    
    e. Create a function named `prep_iris` that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [34]:
# a. Use the function defined in acquire.py to load the iris data.
import acquire as a
iris = a.get_iris_data()
iris.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [35]:
# b. Drop the species_id and measurement_id columns.
iris.drop(['species_id'], axis=1, inplace=True)
iris.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

In [36]:
# c. Rename the species_name column to just species.
iris.rename(columns={'species_name':'species'}, inplace=True)
iris.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [37]:
# d. Create dummy variables of the species name.
iris_dummies = pd.get_dummies(iris[['species']], drop_first=False)
new_iris = pd.concat([iris, iris_dummies], axis=1)
new_iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

In [38]:
# e. Create a function named prep_iris that accepts the 
# untransformed iris data, and returns the data with the 
# transformations above applied.

def prep_iris(df):
    # a. Use the function defined in acquire.py to load the iris data.
    import acquire as a
    iris = a.get_iris_data()
    
    # b. Drop the species_id and measurement_id columns.
    iris.drop(['species_id'], axis=1, inplace=True)
    
    # c. Rename the species_name column to just species.
    iris.rename(columns={'species_name':'species'}, inplace=True)
    
    # d. Create dummy variables of the species name.
    iris_dummies = pd.get_dummies(iris[['species']], drop_first=False)
    new_iris = pd.concat([iris, iris_dummies], axis=1)
    
    return new_iris

2. Titanic Data

    a. Use the function you defined in `acquire.py` to load the titanic data set.
    
    b. Handle the missing values in the `embark_tow`n and `embarked' columns.
    
    c. Remove the `deck` column.
    
    d. Create a dummy variable of the `embarked` column.
    
    e. Scale the `age` and `fare` columns using a min max scaler. Why might this be beneficial? When might you **not** want to do this?
    
    f. Fill the missing values in `age`. The way you fill these values is up to you. Consider the tradeoffs of different methods.
    
    g. Create a function named `prep_titanic` that accepts the untransformed titanic data, and returns the data with the transformations above applied.

In [39]:
# a. Use the function you defined in acquire.py to load the titanic 
# data set.
titanic = a.get_titanic_data()
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [40]:
# b. Handle the missing values in the embark_town and `embarked' 
# columns.
titanic.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [41]:
#dropped null embark_town rows since only 2 observations
titanic = titanic[titanic.embark_town.notnull()]
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [42]:
# c. Remove the deck column.
titanic.drop(columns='deck', inplace=True)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1

In [43]:
# d. Create a dummy variable of the embarked column.
titanic_dummies = pd.get_dummies(titanic['embarked'])
titanic = pd.concat([titanic, titanic_dummies], axis=1)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,C,Q,S
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0,0,0,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0,1,0,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1,0,0,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0,0,0,1
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1,0,0,1

In [44]:
# e. Scale the age and fare columns using a min max scaler. 
# Why might this be beneficial? When might you not want to do this?

In [45]:
# f. Fill the missing values in age. The way you fill these values 
# is up to you. Consider the tradeoffs of different methods.
from sklearn.model_selection import train_test_split

train_validate, test = train_test_split(titanic, test_size=.2,
                                       random_state=123,
                                       stratify=titanic.survived)
train_validate.shape, test.shape

((711, 15), (178, 15))

In [46]:
train, validate = train_test_split(train_validate, test_size=.3, 
                                   random_state=123, 
                                   stratify=train_validate.survived)
train.shape, validate.shape

((497, 15), (214, 15))

In [52]:
# impute missing values for age based on mean for each sample
import warnings
warnings.filterwarnings("ignore")

from sklearn.impute import SimpleImputer

my_strategy = 'mean'
column_list = ['age']

def impute(train, validate, test, my_strategy, column_list):
    imputer = SimpleImputer(strategy=my_strategy)
    train[column_list] = imputer.fit_transform(train[column_list])
    validate[column_list] = imputer.transform(validate[column_list])
    test[column_list] = imputer.transform(test[column_list])
    return train, validate, test

In [55]:
titanic = impute(train, validate, test, my_strategy, column_list)

print(train.age.isnull().sum() + validate.age.isnull().sum() + test.age.isnull().sum())

0

In [56]:
# g. Create a function named prep_titanic that accepts the 
# untransformed titanic data, and returns the data with the 
# transformations above applied.

def prep_titanic(df):
    # load the titanic data set.
    titanic = a.get_titanic_data()
    
    # Handle the missing values in the embark_town and `embarked' columns.
    titanic = titanic[titanic.embark_town.notnull()]
    
    # Remove the deck column.
    titanic.drop(columns='deck', inplace=True)
    
    # Create a dummy variable of the embarked column.
    titanic_dummies = pd.get_dummies(titanic['embarked'])
    titanic = pd.concat([titanic, titanic_dummies], axis=1)
    
     #Fill the missing values in age. Use train test validate samples to fill each with mean age of each sample
    from sklearn.model_selection import train_test_split

    train_validate, test = train_test_split(titanic, test_size=.2,
                                       random_state=123,
                                       stratify=titanic.survived)
    train, validate = train_test_split(train_validate, test_size=.3, 
                                   random_state=123, 
                                   stratify=train_validate.survived)
    # impute missing values for age based on mean for each sample
    import warnings
    warnings.filterwarnings("ignore")

    from sklearn.impute import SimpleImputer

    my_strategy = 'mean'
    column_list = ['age']

    def impute(train, validate, test, my_strategy, column_list):
        imputer = SimpleImputer(strategy=my_strategy)
        train[column_list] = imputer.fit_transform(train[column_list])
        validate[column_list] = imputer.transform(validate[column_list])
        test[column_list] = imputer.transform(test[column_list])
        return train, validate, test
    return test, train, validate